#include <QCoreApplication>
#include <stdio.h>






//======================================================================================================
int main(int argc, char *argv[])
{
    QCoreApplication q(argc, argv);


    //    1. Написать программу, которая определяет, является ли введенная скобочная последовательность правильной.
    //      Примеры правильных скобочных выражений: (), ([])(), {}(), ([{}]), неправильных — )(, ())({), (, ])}), ([(])
    //      для скобок [,(,{. Например: (2+(2*2)) или [2/{5*(4+7)}]



    //    2. Создать функцию, копирующую односвязный список (без удаления первого списка).



    //    3.  Реализуйте алгоритм, который определяет, отсортирован ли связный список.



    return 0;
}

